<?php

class Constants
{
    /**
     * Премодерация предложений инвесторов
     */
    const INVESTOR_PREMODERATION        = true;
    
    /*********************************************
     * 
     * Авторизация
     * 
     *********************************************/
    
    /**
     * Кол-во неудачных попыток с одного IP не зависимо от пользователя
     */
    const AUTH_IP_TRY       = 5;
    /**
     * Кол-во часов, за которые считать неудачные попытки авторизации с одного IP
     */
    const AUTH_IP_PERIOD    = 6;
    /**
     * Кол-во минут задержки при срабатывании защиты
     */
    const AUTH_DELAY = 5;
    /**
     * Количество неудачных предыдущих попыток с учетом пользователя
     */
    const AUTH_USER_TRY = 10;
    /**
     * Кол-во часов, за сколько считать неудачные попытки авторизации от пользователя
     */
    const AUTH_USER_PERIOD = 6;
    
    /**
     * Логировать каждое действие (т.е. записывать в БД время последнего действия (инициализации) пользователя)
     */
    const USER_LOG_ACTION = true;
    /**
     * Глубина просмотра логов при авторизации по кукам/сессии
     */
    const USER_AUTH_LOG_DEEP = 3;
    /**
     * Время жизни куки авторизации пользователя: 2 * 365 * 24 * 3600
     */
    const COOKIE_LIFETIME = 63072000;
    
    
}